var num1 = '563442503462436524435424010216244353454543545646545645646542314212153153153215341513214534345434240102164324341324242744214564564546456454324545642345537413215342514325123451425433451234152345454542145364545244242425634425034624365244354240102164324341324242744215374132153425143251234514254334512341523454545421453645452442424256153123123123153153';
var num2 = '425412421024210124510125654531234542324535';
// console.log(String(num1 + num2));
// console.log(num1 + num2)
function addTwoNumbers(str1,str2) {
    let carry = 0, //是否有进位
    l1 = str1.length, //数值一的长度
    l2 = str2.length, //数值二的长度
    arr = [];  //为变成字符串大值做准备
    
    var max =Math.max(l1 ,l2); //最大长度
    for(let i=l1 -1,j=l2-1,n = max - 1; n>=0; n--,i--,j--){ //倒着循环，退出条件时最大的长度为0
        // 逐位相加 再加上进位
        var sum = (+str1[i]|| 0) + (+str2[j] || 0) + carry;
        // 设置carry值，得到正确的位
        if (sum >= 10) {
            carry = 1;
            arr.push(sum - 10)
        }else {
            carry = 0;
            arr.push(sum);
        }
    }
    if (carry > 0) {//最后还有进位
        arr.push(carry)
    }
    return arr.reverse().join('')
}
console.log(addTwoNumbers(num1,num2))